fanjiangbo/Code-review/Magnetic_BeijinJikang_V6/Modbus/src/STM32FXModbus.c
/***************************************************************************************
                                This file is the STM32FX
                        Usart1 functions implement source file
                Edited by Xie yuyin 2019-09-18 the first edtion, Soway Co., Ltd
***************************************************************************************/
//Include files
#include "STM32FX_Systick.h"
#include "stm32fxmodbuslib.h"

//Communicate depart define
#define MODBUS_RTU_DLY      3
#define MODBUS_ASCII_DLY    20
#define MODBUS_CMD_ERR_MASK 0x80

//Datatype define
//---------------Queue datatype structure define------------------------
typedef struct{
	u16	head;	//queue front
	u16	tail;	//queue rear(tail)
	u16	size;	//queue size
	u8*	pqbuf;	//queue pointer
}S_QUEUE_TAG, *PS_QUEUE_TAG;

//--------------define send data structure------------------------------
typedef struct{
    u8* psndbuf;
    u16 bufsize;
}S_SNDDAT_TAG,*PS_SNDDAT_TAG;

//--------------define parse structure----------------------------------
typedef struct{
    u8*             pbuf;
    u32             bufsize;
    ModbusParseFunc pparse;
}S_PARSE_TAG, *PS_PARSE_TAG;

static union{
    u8 flgbyte;
    struct{
        u8 flgtransing: 1;
        u8 flgtestbit:  1;
        u8 flgreserve:  6;
    }flgbits;
}u_flag;

//Variables define
static u8 modbus_idle_int_flg = 1;
static u16 DMACurDataCounter;

static S_COMM_PARA s_compara = { 0x01, 0x03, 0x03, 0x01 };  //Slv_addr 9600 NO_Parity RTU
static S_QUEUE_TAG s_mdbs_rcv;
static S_SNDDAT_TAG s_mdbs_snd;
static S_PARSE_TAG s_mdbs_parse;

//Modbus function code variables
static S_F03_EX_PARA s_f03; //f10
static S_F04_EX_PARA s_f04;
static S_F05_EX_PARA s_f05;
static S_F26_EX_PARA s_f26; //f27
static S_F25_EX_PARA s_f25;
static S_F2A_EX_PARA s_f2A; //f2B

//Local functions declare
static void STM32FX_Modbus_Timer7Config( void );
static bool STM32FX_Modbus_ModbusTimer( void* pdat );
static void STM32FX_Modbus_CommunicateDMAConfig( void );
static void STM32FX_Modbus_CommunicatePortPinAndIntInit( void );
static void STM32FX_Modbus_CommunicateResponseInformation( u16 datlen );

static Modbus_Result STM32FX_Modbus_FunctionCode03Process( u16 regnum, u16 star_addr );
static Modbus_Result STM32FX_Modbus_FunctionCode04Process( u16 reg_num, u16 star_addr );
static Modbus_Result STM32FX_Modbus_FunctionCode26Process( u16 reg_num, u16 star_addr );
static Modbus_Result STM32FX_Modbus_FunctionCode2BProcess( u16 reg_num, u16* star_addr );
static Modbus_Result STM32FX_Modbus_FunctionCode10Process( u8* psrc, u16 reg_num, u16 star_addr );
static Modbus_Result STM32FX_Modbus_FunctionCode27Process( u8* psrc, u16 reg_num, u16 star_addr );


//Functions implement
/***************************************************************************************
Name:   
Func:   
Para:   
Retn:  
***************************************************************************************/
#define ASCII_FRAME_HEADER  0x3A
#define ASCII_FRAME_ENTER   0x0D
#define ASCII_FRAME_NEWLINE 0x0A
#define ASCII_FRAME_ENDFLAG 0x0D0A
static bool STM32FX_Modbus_ModbusTimer( void* pdat )
{
    u32 len;
    u8* ptmp;
    u16 crc_chk;
    u16 tmp;
    
    //Parse parameter not init
    if (!s_mdbs_parse.pbuf)
        return false;
    
    s_mdbs_rcv.tail =s_mdbs_rcv.size - DMACurDataCounter;
    memset( s_mdbs_parse.pbuf, 0, s_mdbs_parse.bufsize );
    
    len = 0;
    while (s_mdbs_rcv.head != s_mdbs_rcv.tail)
    {
#ifdef USE_IDWDG
            FEED_I_WATCHDOG();
#endif
        //Read data
        s_mdbs_parse.pbuf[len ++] = s_mdbs_rcv.pqbuf[s_mdbs_rcv.head ++];
        if (s_mdbs_rcv.head == s_mdbs_rcv.size)
        {
            s_mdbs_rcv.head = 0;
        }
        if (len == s_mdbs_parse.bufsize) //Error, parse buffer overflow
        {
            len = 0;
        }
    }
    
    //If data formate is ASCII convert to common formate
    if (s_compara.ModbusType == MODBUS_ASCII)
    {
        //Conver ASCII formate to common formate
        do{
            if (len < 3)
                break;
            
            ptmp = s_mdbs_parse.pbuf;
            if (*ptmp != ASCII_FRAME_HEADER)
                break;
            
            ptmp = s_mdbs_parse.pbuf + len - 2;
            if (*ptmp != ASCII_FRAME_ENTER)
                break;
            
            ptmp ++;
            if (*ptmp != ASCII_FRAME_NEWLINE)
                break;
            
            if (!COMMON_ConverAscii2CommonMode(s_mdbs_parse.pbuf, len))
                break;
            
            ptmp = s_mdbs_parse.pbuf;
            len = (len - 5) / 2;    //Remove 0x3A 0x0D 0x0A and LRC
            
            if ((*ptmp) && (*ptmp) != s_compara.SlaveAddr)
                break;
            
            len --; //Remove slave address
            if (*ptmp ++)
            {
                s_mdbs_parse.pparse( ptmp, len, 0 );
            }
            else
            {
                s_mdbs_parse.pparse( ptmp, len, 1 );
            }
        }while(0);
    }
    else
    {
        //Check CRC and strip address
        do{
            if (len < 4)
                break;
            
            //Judge slaver address
            ptmp = s_mdbs_parse.pbuf;
            if ((*ptmp) && (*ptmp) != s_compara.SlaveAddr)
                break;
            
            len -= 2;   //CRC length 2 bytes:CRC_L, CRC_H
            if (!COMMON_GeneratorU16bitsCRCCheckCode( &crc_chk, s_mdbs_parse.pbuf, len ))
                break;
            
            ptmp += len;
            tmp = *ptmp ++;
            tmp |= (*ptmp) << 8;
            
            if (tmp != 0xFFFF)
            {
                if (tmp != crc_chk) //CRC check error
                    break;
            }
            len --;
            ptmp = s_mdbs_parse.pbuf;
            if (*ptmp ++)
            {
                s_mdbs_parse.pparse( ptmp, len, 0 );
            }
            else
            {
                s_mdbs_parse.pparse( ptmp, len, 1 );
            }
        }
        while (0);
    }

