fanjiangbo/Code-review/Magnetic_BeijinJikang_V6/Modbus/src/STM32FXModbus.c
    return false;
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:  
***************************************************************************************/
void USART1_IRQHandler( void )
{
    //Usart1 idle interrupt
    if (USART_GetITStatus( MODBUS_USARTNUM, USART_IT_IDLE ))
	{
        USART_ClearITPendingBit( MODBUS_USARTNUM, USART_IT_IDLE );
        
        if (modbus_idle_int_flg)
        {
            modbus_idle_int_flg = 0;
        }
        else
        {
            u32 dlyms;
            dlyms = (s_compara.ModbusType == MODBUS_ASCII) ? MODBUS_ASCII_DLY : MODBUS_RTU_DLY;
            DMACurDataCounter = DMA_GetCurrDataCounter( MODBUSRXD_DMA_CHANNEL );
            STM32FX_Systick_TimerSet( eTmr_ModbusTimer, STM32FX_Modbus_ModbusTimer, NULL, dlyms );
        }
	}
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:  
***************************************************************************************/
void DMA1_Channel2_3_IRQHandler( void )
{
     if (DMA_GetITStatus(DMA1_FLAG_TC2) || DMA_GetITStatus(DMA1_FLAG_TE2))
    {
        //Clear interrupt flag
        DMA_Cmd( MODBUSTXD_DMA_CHANNEL, DISABLE );
        DMA_ClearFlag( MODBUSTXD_DMA_INTFLAG );
        TIM_ITConfig( TIM7, TIM_IT_Update, ENABLE );
        TIM_Cmd( TIM7,ENABLE );
    }
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:  
***************************************************************************************/
static void STM32FX_Modbus_Timer7Config( void )
{
    TIM_TimeBaseInitTypeDef s_timer; 
	NVIC_InitTypeDef NVIC_InitStructure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7,ENABLE);
    
	s_timer.TIM_Prescaler = 47999;     //	1MHz 1us
  	s_timer.TIM_Period = 10;     //	10000us
  	s_timer.TIM_CounterMode = TIM_CounterMode_Up;
  	s_timer.TIM_ClockDivision = TIM_CKD_DIV1;
  	TIM_TimeBaseInit(TIM7, &s_timer);
  
  	NVIC_InitStructure.NVIC_IRQChannel = TIM7_IRQn;
  	NVIC_InitStructure.NVIC_IRQChannelPriority = 0x06;
  	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  	NVIC_Init(&NVIC_InitStructure);

  	TIM_ClearITPendingBit(TIM7, TIM_IT_Update);
  	TIM_ITConfig(TIM7, TIM_IT_Update, DISABLE);
  	TIM_Cmd(TIM7,DISABLE);
  	TIM_SetCounter(TIM7, 0);
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:  
***************************************************************************************/
void TIM7_IRQHandler( void )
{
    if(TIM_GetITStatus(TIM7, TIM_IT_Update) != RESET)
	{
        TIM_ClearITPendingBit(TIM7, TIM_IT_Update);

        if (u_flag.flgbits.flgtransing)
        {
            u_flag.flgbits.flgtransing = 0;
            RS485_RX_ENABLE();
        }
        
        TIM_Cmd(TIM7,DISABLE);
        TIM_SetCounter(TIM7, 0);
        TIM_ITConfig(TIM7, TIM_IT_Update, DISABLE);
	}
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:  
***************************************************************************************/
bool STM32FX_Modbus_CommunicateInit( PS_COMM_BUFPARA pbufpara, ModbusParseFunc pFunc )
{
    bool ret;
    
    //Parameter init
    memset( &s_mdbs_rcv, 0, sizeof(S_QUEUE_TAG));   //Receive RS485 data queue
    memset( &s_mdbs_snd, 0, sizeof(S_SNDDAT_TAG));  //Send data to RS485 parameter init
    memset( &s_mdbs_parse, 0, sizeof(S_PARSE_TAG)); //Paser data init
    
    //Receive, send and paser parameter init
    do{
        if ((!pbufpara->prcv) || (!pbufpara->psnd) || (!pbufpara->pparse))
        {
            ret = false;
            break;
        }
        
        if ((!pbufpara->rcvsize) || (!pbufpara->sndsize) || (!pbufpara->parsesize))
        {
            ret = false;
            break;
        }
        
        s_mdbs_rcv.pqbuf = pbufpara->prcv;
        s_mdbs_rcv.size = pbufpara->rcvsize;
        
        s_mdbs_snd.psndbuf = pbufpara->psnd;
        s_mdbs_snd.bufsize = pbufpara->sndsize;
        
        s_mdbs_parse.pbuf = pbufpara->pparse;
        s_mdbs_parse.bufsize = pbufpara->parsesize;
        s_mdbs_parse.pparse = pFunc;
    }while (0);

//    //Timer3 congfig
    STM32FX_Modbus_Timer7Config( );
                        
    //USART1 port and pin init
    STM32FX_Modbus_CommunicatePortPinAndIntInit();
    
    //USART receive DMA init
    STM32FX_Modbus_CommunicateDMAConfig( );
    
    STM32FX_Modbus_CommunicateCommParaConfig( &s_compara );
    return ret;
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
static void STM32FX_Modbus_CommunicatePortPinAndIntInit( void )
{
    GPIO_InitTypeDef GPIO_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    
    //Init USART1 NVIC
    NVIC_InitStructure.NVIC_IRQChannel = MODBUS_USARTIRQN;
    NVIC_InitStructure.NVIC_IRQChannelPriority = MODBUS_USARTPRIO;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    //Init DMA1_TxD NVIC
    NVIC_InitStructure.NVIC_IRQChannel = MODBUSTXD_DMA_IRQN;
    NVIC_InitStructure.NVIC_IRQChannelPriority = MODBUSTXD_DMA_PRIO;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    
    //Enable clock
    RCC_AHBPeriphClockCmd(MODBUS_PORT_RCC, ENABLE);
    RCC_APB2PeriphClockCmd(MODBUS_USART_RCC, ENABLE);
    
    //Communicate port and pin inite
    GPIO_PinAFConfig(MODBUS_AFSOURCEPORT, MODBUS_TXD_AFSOURCE, GPIO_AF_1);
    GPIO_PinAFConfig(MODBUS_AFSOURCEPORT, MODBUS_RXD_AFSOURCE, GPIO_AF_1);
    
    GPIO_InitStructure.GPIO_Pin = MODBUS_RXD_PIN | MODBUS_TXD_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init( MODBUS_TXD_PORT, &GPIO_InitStructure );
    
    //RS485 control pin init
    RCC_AHBPeriphClockCmd(RS485_RCC_SOURCE, ENABLE);
    
    GPIO_InitStructure.GPIO_Pin = RS485_RX_CTRL_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init( RS485_RX_CTRL_PORT, &GPIO_InitStructure );
    RS485_RX_ENABLE();
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
void STM32FX_Modbus_CommunicateCommParaConfig( PS_COMM_PARA pcompara )
{
    USART_InitTypeDef USART_InitStru;
    
    memcpy( (u8*)&s_compara, (u8*)pcompara, sizeof(S_COMM_PARA) );
    
    //Communicate USART init
	switch (pcompara->BaudRate)
    {
    case 1:
        USART_InitStru.USART_BaudRate = 2400;
        break;
        
