fanjiangbo/Code-review/Magnetic_BeijinJikang_V6/Modbus/src/STM32FXModbus.c
    case 2:
        USART_InitStru.USART_BaudRate = 4800;
        break;
        
    case 3:
        USART_InitStru.USART_BaudRate = 9600;
        break;
        
    case 4:
        USART_InitStru.USART_BaudRate = 19200;
        break;
        
    case 5:
        USART_InitStru.USART_BaudRate = 38400;
        break;
        
    case 6:
        USART_InitStru.USART_BaudRate = 57600;
        break;
        
    case 7:
        USART_InitStru.USART_BaudRate = 115200;
        break;
        
    default:
        USART_InitStru.USART_BaudRate = 9600;
        break;
    }
    
    switch (pcompara->Parity)
    {
        case 1:
            USART_InitStru.USART_Parity = USART_Parity_Odd;
            USART_InitStru.USART_StopBits = USART_StopBits_1;
            USART_InitStru.USART_WordLength = USART_WordLength_9b;
            break;
            
        case 2:
            USART_InitStru.USART_Parity = USART_Parity_Even;
            USART_InitStru.USART_StopBits = USART_StopBits_1;
            USART_InitStru.USART_WordLength = USART_WordLength_9b;
            break;
            
        case 3:
            USART_InitStru.USART_Parity = USART_Parity_No;
            USART_InitStru.USART_StopBits = USART_StopBits_2;
            USART_InitStru.USART_WordLength = USART_WordLength_8b;
            break;
            
        default:
            USART_InitStru.USART_Parity = USART_Parity_No;
            USART_InitStru.USART_StopBits = USART_StopBits_2;
            USART_InitStru.USART_WordLength = USART_WordLength_8b;
            break;
    }
    
	USART_InitStru.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStru.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init( MODBUS_USARTNUM, &USART_InitStru );
    
    USART_ClearITPendingBit( MODBUS_USARTNUM, USART_IT_IDLE );
    USART_ClearITPendingBit( MODBUS_USARTNUM, USART_IT_IDLE );
	USART_ITConfig( MODBUS_USARTNUM, USART_IT_IDLE, ENABLE );
    USART_ITConfig( MODBUS_USARTNUM, USART_IT_TXE, DISABLE );
	USART_ITConfig( MODBUS_USARTNUM, USART_IT_RXNE, DISABLE );
	USART_ClearFlag( MODBUS_USARTNUM, USART_FLAG_TC );
    USART_ClearITPendingBit( MODBUS_USARTNUM, USART_IT_IDLE );
    USART_Cmd( MODBUS_USARTNUM, ENABLE );
}

/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
static void STM32FX_Modbus_CommunicateDMAConfig( void )
{
    DMA_InitTypeDef DMA_InitStructure;

	RCC_AHBPeriphClockCmd( RCC_AHBPeriph_DMA1, ENABLE );
    
    //Rx DMA Channel init
	DMA_DeInit( MODBUSRXD_DMA_CHANNEL );
	DMA_InitStructure.DMA_PeripheralBaseAddr = (u32)(&(MODBUS_USARTNUM->RDR));
	DMA_InitStructure.DMA_MemoryBaseAddr = (u32)s_mdbs_rcv.pqbuf;
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
	DMA_InitStructure.DMA_BufferSize = s_mdbs_rcv.size;
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
	DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
	DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
	DMA_Init( MODBUSRXD_DMA_CHANNEL, &DMA_InitStructure );

	USART_DMACmd( MODBUS_USARTNUM, USART_DMAReq_Rx, ENABLE );
	DMA_Cmd( MODBUSRXD_DMA_CHANNEL, ENABLE );
    
    //Tx DMA Channel init
    //DMA_DeInit( MODBUSTXD_DMA_CHANNEL );
    DMA_InitStructure.DMA_PeripheralBaseAddr = (u32)(&(MODBUS_USARTNUM->TDR));
    DMA_InitStructure.DMA_MemoryBaseAddr = (u32)s_mdbs_snd.psndbuf;
    DMA_InitStructure.DMA_BufferSize = s_mdbs_snd.bufsize;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
	DMA_Init( MODBUSTXD_DMA_CHANNEL, &DMA_InitStructure );
    
    DMA_ClearFlag( MODBUSTXD_DMA_INTFLAG );
    DMA_ITConfig( MODBUSTXD_DMA_CHANNEL, DMA_IT_TC | DMA_IT_TE, ENABLE);
    USART_DMACmd( MODBUS_USARTNUM, USART_DMAReq_Tx, ENABLE );
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
static void STM32FX_Modbus_CommunicateResponseInformation( u16 datlen )
{
    u8* pans;
    
    if (!datlen)
        return;
    
    //Response operator result
    if (s_compara.ModbusType == MODBUS_ASCII)
    {
        u8 lrcchk;
        lrcchk = COMMON_GeneratorLRCCheckCode( s_mdbs_snd.psndbuf, datlen);
        pans = s_mdbs_snd.psndbuf + datlen;
        *pans = lrcchk;
        datlen ++;
        if (!COMMON_ConvertHex2Ascii( s_mdbs_snd.psndbuf, datlen ))
            return;
        datlen *= 2;
        pans = s_mdbs_snd.psndbuf;
        *pans++ = ASCII_FRAME_HEADER;
        pans += datlen;
        COMMON_Bits16Convert2Bits8( pans, ASCII_FRAME_ENDFLAG, BIGENDDIAN );
        datlen += 3;
    }
    else
    {
        u16 crc_chk;
        COMMON_GeneratorU16bitsCRCCheckCode( &crc_chk, s_mdbs_snd.psndbuf, datlen );
        COMMON_Bits16Convert2Bits8( s_mdbs_snd.psndbuf + datlen, crc_chk, LITTLEENDIAN );
        datlen += 2;
    }
    
    //Send response imformation
    STM32FX_Modbus_CommunicateSendData( datlen );
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
#define UPGRADE_SUCCEED 0x00
#define UPGRADE_RCVFAIL 0x01
#define UPGRADE_CHKERR  0x02
void STM32FX_Modbus_UpgradeResponseProcess( u8* psrc, u16 len )
{
    u8* ptmp;
    
    ptmp = s_mdbs_snd.psndbuf;
    *ptmp ++ = s_compara.SlaveAddr;
    memcpy(ptmp, psrc, 3);
    ptmp += 3;
    COMMON_Bits16Convert2Bits8( ptmp, len, BIGENDDIAN );
    ptmp += 2;
    memcpy(ptmp, (psrc + 3), len);

    STM32FX_Modbus_CommunicateResponseInformation( len + 6 );
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
void STM32FX_Modbus_CommunicateSendData( u16 len )
{
    if ((!s_mdbs_snd.psndbuf) || (!len) || (len >= s_mdbs_snd.bufsize))
        return;
    
