fanjiangbo/Code-review/Magnetic_BeijinJikang_V6/Modbus/src/STM32FXModbus.c
    //Enalbe trans data
    RS485_TX_ENABLE();
    u_flag.flgbits.flgtransing = 1;
    MODBUSTXD_DMA_CHANNEL->CNDTR = len;
    DMA_Cmd( MODBUSTXD_DMA_CHANNEL, ENABLE );
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
bool STM32FX_Modbus_ModbusIsSendingData( void )
{
    if (u_flag.flgbits.flgtransing)
        return true;
    else
        return false;
}


//================================================================================================
/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
bool STM32FX_Modbus_FunctionCode03ParameterInit( PS_F03_EX_PARA pdat )
{
    bool ret = true;
    
    do{
        if ((!pdat->pAddrTab) || (!pdat->pStVal))
        {
            ret = false;
            break;
        }
        memset( &s_f03, 0, sizeof(S_F03_EX_PARA) );
        s_f03.pStVal = pdat->pStVal;
        s_f03.pAddrTab = pdat->pAddrTab;
        s_f03.paranum = pdat->paranum;
    }while (0);
    
    return ret;
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
bool STM32FX_Modbus_FunctionCode04ParameterInit( PS_F04_EX_PARA pdat )
{
    bool ret = true;
    
    do{
        if ((!pdat->pAddrTab) || (!pdat->pStVal))
        {
            ret = false;
            break;
        }
        memset( &s_f04, 0, sizeof(S_F04_EX_PARA) );
        s_f04.pStVal = pdat->pStVal;
        s_f04.pAddrTab = pdat->pAddrTab;
        s_f04.paranum = pdat->paranum;
    }while(0);
    
    return ret;
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
bool STM32FX_Modbus_FunctionCode26ParameterInit( PS_F26_EX_PARA pdat )
{
    bool ret = true;
    
    do{
        if ((!pdat->pAddrTab) || (!pdat->pStVal))
        {
            ret = false;
            break;
        }
        memset( &s_f26, 0, sizeof(S_F26_EX_PARA) );
        s_f26.pStVal = pdat->pStVal;
        s_f26.pAddrTab = pdat->pAddrTab;
        s_f26.paranum = pdat->paranum;
    }while(0);
    
    return ret;
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
bool STM32FX_Modbus_FunctionCode05ParameterInit( PS_F05_EX_PARA pdat )
{
    bool ret = true;
    
    do{
        if ((!pdat->pAddrTab) || (!pdat->pStVal))
        {
            ret = false;
            break;
        }
        memset( &s_f05, 0, sizeof(S_F05_EX_PARA) );
        s_f05.pStVal = pdat->pStVal;
        s_f05.pAddrTab = pdat->pAddrTab;
        s_f05.paranum = pdat->paranum;
    }while(0);
    
    return ret;
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
bool STM32FX_Modbus_FunctionCode25ParameterInit( PS_F25_EX_PARA pdat )
{
    bool ret = true;
    
    do{
        if ((!pdat->pAddrTab) || (!pdat->pStVal))
        {
            ret = false;
            break;
        }
        memset( &s_f25, 0, sizeof(S_F25_EX_PARA) );
        s_f25.pStVal = pdat->pStVal;
        s_f25.pAddrTab = pdat->pAddrTab;
        s_f25.paranum = pdat->paranum;
    }while(0);
    
    return ret;
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
bool STM32FX_Modbus_FunctionCode2AParameterInit( PS_F2A_EX_PARA pdat )
{
    bool ret = true;
    
    do{
        if ((!pdat->pAddrTab) || (!pdat->pString))
        {
            ret = false;
            break;
        }
        memset( &s_f2A, 0, sizeof(S_F2A_EX_PARA) );
        s_f2A.pString = pdat->pString;
        s_f2A.pAddrTab = pdat->pAddrTab;
        s_f2A.paranum = pdat->paranum;
    }while(0);
    
    return ret;
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
#define BEIJING_JIKANG_ADDR 0xFF00
Modbus_Result STM32FX_Modbus_FunctionCodeReadData( u8* psrc )
{
    u8  sendlen;
    u8* ptmp;
    u16 regnum;
    u16 randval;
    Modbus_Result re = ModbusOperatorSucceed;
    
    ptmp = psrc + 1;    //f_cmd, star_addr_l, star_addr_h, reg_num_l, reg_num_h, ...
    GET_BIGENDIAN16(randval, ptmp);
    GET_BIGENDIAN16(regnum, ptmp);
    
    switch (*psrc)
    {
        case FUNC03_READ:
//            re = STM32FX_Modbus_FunctionCode03Process( regnum, randval );
             if (randval)                       //查设备地址命令，消息ID为FF 00
            {
                if (randval == BEIJING_JIKANG_ADDR) //Only for BeijingJK
                    randval = 0x0030;
                
                re = STM32FX_Modbus_FunctionCode03Process( regnum, randval );
            }
            else                                //读数据命令，消息ID为00 00
            {
                randval = 0x0006;   //Use position3 address, need to modify UserApp func MAGNETAPP_ProcessSensorData
                re = STM32FX_Modbus_FunctionCode04Process( regnum, randval );
            }
            break;
            
        case FUNC04_READ:
            re = STM32FX_Modbus_FunctionCode04Process( regnum, randval );
            break;
            
        case FUNC26_READ:
            re = STM32FX_Modbus_FunctionCode26Process( regnum, randval );
            break;
            
