fanjiangbo/Code-review/Magnetic_BeijinJikang_V6/Modbus/src/STM32FXModbus.c
        case FUNC2B_READ:
            re = STM32FX_Modbus_FunctionCode2BProcess( regnum, &randval );
            break;
    }
    
    ptmp = s_mdbs_snd.psndbuf;
    *ptmp++ = s_compara.SlaveAddr;
    if (re == ModbusOperatorSucceed)
    {
        *ptmp ++ = *psrc;
        if (*psrc != FUNC2B_READ)
        {
            *ptmp = regnum * 2;
            sendlen = regnum * 2 + 3;
        }
        else
        {
            *ptmp ++ = regnum >> 8;
            *ptmp = (u8)regnum;
            sendlen = randval + 4;
        }
    }
    else
    {
        *ptmp ++ = *psrc | MODBUS_CMD_ERR_MASK;
        *ptmp = re;
        sendlen = 3;
    }
    
    //Send response imformation
    STM32FX_Modbus_CommunicateResponseInformation( sendlen );
    
    return re;
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
static Modbus_Result STM32FX_Modbus_FunctionCode03Process( u16 reg_num, u16 star_addr )
{
    u8 i;
    u8* pdest;
    
    Modbus_Result ret = ModbusOperatorSucceed;
    
    do{
        if ((!reg_num) || (reg_num > s_f03.paranum))
        {
            ret = RegisterNumberError;
            break;
        }
        for (i = 0; i < s_f03.paranum; i ++)
        {
            if (s_f03.pAddrTab[i] == star_addr)
            {
                break;
            }
        }
        if (i >= s_f03.paranum)
        {
            ret = ReadDatItemNotSupport;
            break;
        }
        
        pdest = s_mdbs_snd.psndbuf + 3;  //slv_addr f_cmd, dat_len, {data_list}
        while (reg_num --)
        {
            COMMON_Bits16Convert2Bits8( pdest, *(s_f03.pStVal + i), BIGENDDIAN);
            pdest += 2;
            if (++ i > s_f03.paranum)
            {
                ret = OperatorPraraError;
                break;
            }
        }
    }while (0);
    
    return ret;
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
static Modbus_Result STM32FX_Modbus_FunctionCode04Process( u16 reg_num, u16 star_addr )
{
    u8 i;
    u8* pdest;
    
    Modbus_Result ret = ModbusOperatorSucceed;
    
    do{
        if ((reg_num < 2) || (reg_num % 2) || (reg_num / 2 > s_f04.paranum))
        {
            ret = RegisterNumberError;
            break;
        }
        for (i = 0; i < s_f04.paranum; i ++)
        {
            if (s_f04.pAddrTab[i] == star_addr)
            {
                break;
            }
        }
        if (i >= s_f04.paranum)
        {
            ret = ReadDatItemNotSupport;
            break;
        }
        
        pdest = s_mdbs_snd.psndbuf + 3;  //slv_addr f_cmd, dat_len, {data_list}
        while (reg_num)
        {
            COMMON_Bits32Convert2Bits8( pdest, *(s_f04.pStVal + i), BIGENDDIAN);
            pdest += 4;
            reg_num -= 2;
            if (++ i > s_f04.paranum)
            {
                ret = OperatorPraraError;
                break;
            }
        }
    }while (0);
    
    return ret;
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
static Modbus_Result STM32FX_Modbus_FunctionCode26Process( u16 reg_num, u16 star_addr )
{
    u8 i;
    u8* pdest;
    
    Modbus_Result ret = ModbusOperatorSucceed;
    do{
        if ((reg_num < 2) || (reg_num % 2) || (reg_num / 2 > s_f26.paranum))
        {
            ret = RegisterNumberError;
            break;
        }
        for (i = 0; i < s_f26.paranum; i ++)
        {
            if (s_f26.pAddrTab[i] == star_addr)
            {
                break;
            }
        }
        if (i >= s_f26.paranum)
        {
            ret = ReadDatItemNotSupport;
            break;
        }
        
        pdest = s_mdbs_snd.psndbuf + 3;  //slv_addr f_cmd, dat_len, {data_list}
        while (reg_num)
        {
            COMMON_Bits32Convert2Bits8( pdest, *(s_f26.pStVal + i), BIGENDDIAN);
            pdest += 4;
            reg_num -= 2;
            if (++ i > s_f26.paranum)
            {
                ret = OperatorPraraError;
                break;
            }
        }
    }while (0);
    
    return ret;
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
static Modbus_Result STM32FX_Modbus_FunctionCode10Process( u8* psrc, u16 reg_num, u16 star_addr )
{
    u8 i;
    //datlen {datalist}
    Modbus_Result ret = ModbusOperatorSucceed;
    
    do{
        if (!psrc)
        {
            ret = FuncOperationFailed;
            break;
        }
        if ((!reg_num) || (reg_num > s_f03.paranum) || (reg_num * 2 != *psrc))
        {
            ret = RegisterNumberError;
            break;
        }
        for (i = 0; i < s_f03.paranum; i ++)
        {
            if (s_f03.pAddrTab[i] == star_addr)
            {
                break;
            }
        }
        if (i >= s_f03.paranum)
        {
            ret = ReadDatItemNotSupport;
            break;
        }
        
        psrc ++;
        while (reg_num --)
        {
            COMMON_Bits8Convert2Bits16( s_f03.pStVal + i, psrc, BIGENDDIAN );
            psrc += 2;
            if (++ i > s_f03.paranum)
            {
                ret = OperatorPraraError;
                break;
            }
        }
    }while (0);
    
    return ret;
}



/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
static Modbus_Result STM32FX_Modbus_FunctionCode27Process( u8* psrc, u16 reg_num, u16 star_addr )
{
    u8 i;
    //datlen {datalist}
    Modbus_Result ret = ModbusOperatorSucceed;
    
    do{
        if (!psrc)
        {
            ret = FuncOperationFailed;
            break;
        }
        if ((reg_num < 2) || (reg_num / 2 > s_f26.paranum) || (reg_num * 2 != *psrc))
        {
            ret = RegisterNumberError;
            break;
        }
        for (i = 0; i < s_f26.paranum; i ++)
        {
            if (s_f26.pAddrTab[i] == star_addr)
            {
                break;
            }
        }
        if (i >= s_f26.paranum)
        {
            ret = ReadDatItemNotSupport;
            break;
        }
        
        psrc ++;
        while (reg_num)
        {
            COMMON_Bits8Convert2Bits32( s_f26.pStVal + i, psrc, BIGENDDIAN );
            psrc += 4;
            reg_num -= 2;
            if (++ i > s_f26.paranum)
            {
                ret = OperatorPraraError;
                break;
            }
        }
    }while (0);
    
    return ret;
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
static Modbus_Result STM32FX_Modbus_FunctionCode2BProcess( u16 reg_num, u16* star_addr )
{
    u8 i;
    u8* pdest;
    u8* prec;
    u16 len;
    u16 totlen = 0;
    const char* ptmp;
    Modbus_Result ret = ModbusOperatorSucceed;
    
    (*star_addr) &= 0xFF;
    do{
        if (reg_num > s_f2A.paranum)
        {
            ret = RegisterNumberError;
            break;
        }
        for (i = 0; i < s_f2A.paranum; i ++)
        {
            if (s_f2A.pAddrTab[i] == (*star_addr))
            {
                break;
            }
        }
        if (i >= s_f2A.paranum)
        {
            ret = ReadDatItemNotSupport;
            break;
        }

        pdest = s_mdbs_snd.psndbuf + 4;  //slv_addr f_cmd 00 reg_num_h item1_id item1_len item1_data
        while (reg_num --)
        {
            len = 0;
            *pdest ++ = (u8)(s_f2A.pAddrTab[i]);
            prec = pdest ++;
            ptmp = s_f2A.pString + i * FUNC2ALEN;
            while (*ptmp && len < FUNC2ALEN)
            {
                *pdest ++ = *ptmp ++;
                len ++;
            }
            
            if (len >= FUNC2ALEN)
            {
                ret = OperatorPraraError;
                break;
            }
            *prec = len;
            totlen += len + 2;
            if (++ i > s_f2A.paranum)
            {
                ret = OperatorPraraError;
                break;
            }
        }
        *star_addr = totlen;
    }while (0);
    
    return ret;
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
    f_code star_addr_h star_addr_l FF(00) 00 CRC_L CRC_H
***************************************************************************************/
Modbus_Result STM32FX_Modbus_FunctionCode05_25WriteData( u8* psrc )
{
    u8 i;
    u8* ptmp;
    u16 star_addr;
    u16 logic_val;
    
