fanjiangbo/Code-review/Magnetic_BeijinJikang_V6/Modbus/src/STM32FXModbus.c
    Modbus_Result re = ModbusOperatorSucceed;
    do{
        if (!psrc)
        {
            re = FuncOperationFailed;
            break;  //break do{}while(0)
        }
        ptmp = psrc + 1;
        GET_BIGENDIAN16(star_addr, ptmp);
        GET_BIGENDIAN16(logic_val, ptmp);
        switch (*psrc)
        {
        case FUNC05_WRITE:
            for (i = 0; i < s_f05.paranum; i ++)
            {
                if (s_f05.pAddrTab[i] == star_addr)
                    break;  //break for
            }
            if (i >= s_f05.paranum)
            {
                re = ReadDatItemNotSupport;
                break;  //break switch
            }
            if (logic_val == MODBUS_LOGIC_TRUE)
            {
                *(s_f05.pStVal + i) = SOWAY_LOGIC_TRUE;
            }
            else if (logic_val == MODBUS_LOGIC_FALSE)
            {
                *(s_f05.pStVal + i) = SOWAY_LOGIC_FALSE;
            }
            else
                re = FuncOperationFailed;
            
            break;  //break switch
            
        case FUNC25_WRITE:
            for (i = 0; i < s_f25.paranum; i ++)
            {
                if (s_f25.pAddrTab[i] == star_addr)
                    break;  //break for
            }
            if (i >= s_f25.paranum)
            {
                re = ReadDatItemNotSupport;
                break;  //break switch
            }
            if (logic_val == MODBUS_LOGIC_TRUE)
            {
                *(s_f25.pStVal + i) = SOWAY_LOGIC_TRUE;
            }
            else if (logic_val == MODBUS_LOGIC_FALSE)
            {
                *(s_f25.pStVal + i) = SOWAY_LOGIC_FALSE;
            }
            else
                re = FuncOperationFailed;
            
            break;  //break switch
        }
    }while (0);
    return re;
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
void STM32FX_Modbus_WriteParameterFunctionResponse( u8* psrc, Modbus_Result res )
{
    u8* ptmp;
    u16 sndlen;
    
    ptmp = s_mdbs_snd.psndbuf;
    *ptmp ++ = s_compara.SlaveAddr;
    
    if (res == ModbusOperatorSucceed)
    {
        memcpy( ptmp, psrc, 5); //slv_addr, f_cmd, star_addr_h, star_addr_l, reg_num_h, reg_num_l
        sndlen = 6; //default operator succeed
    }
    else
    {
        *ptmp ++ = *psrc | MODBUS_CMD_ERR_MASK;
        *ptmp ++ = res;
        sndlen = 3;
    }
    STM32FX_Modbus_CommunicateResponseInformation( sndlen );
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
Modbus_Result STM32FX_Modbus_FunctionCode10_27WriteData( u8* psrc )
{
    u8* ptmp;
    u16 reg_num;
    u16 star_addr;
    //f_cmd, star_addr_l, star_addr_h, reg_num_l, reg_num_h, reg_num_l, datlen, {datalist}
    
    Modbus_Result re = ModbusOperatorSucceed;
    
    do{
        if (!psrc)
        {
            re = FuncOperationFailed;
            break;
        }
        ptmp = psrc + 1;
        GET_BIGENDIAN16(star_addr, ptmp);
        GET_BIGENDIAN16(reg_num, ptmp);
        switch (*psrc)
        {
        case FUNC10_WRITE:
            if (star_addr == BEIJING_JIKANG_ADDR)   //Only for BeijingJK
                star_addr = 0x0030;
            
            re = STM32FX_Modbus_FunctionCode10Process( ptmp, reg_num, star_addr );
            break;
            
        case FUNC27_WRITE:
            re = STM32FX_Modbus_FunctionCode27Process( ptmp, reg_num, star_addr );
            break;
        }
    }while (0);

    return re;
}


/***************************************************************************************
Name:   
Func:   
Para:   
Retn:   
***************************************************************************************/
Modbus_Result STM32FX_Modbus_FunctionCode2AWriteInformation( u8* psrc )
{
    u8 i, len;
    u8* pdest;
    u8* ppara;
    u16 obn, infid;
    Modbus_Result ret = ModbusOperatorSucceed;

    ppara = psrc + 5;
    psrc += 1;
    GET_BIGENDIAN16( infid, psrc );
    infid &= 0xFF;
    GET_BIGENDIAN16( obn, psrc );
    do{
        for (i = 0; i < s_f2A.paranum; i ++)
        {
            if (s_f2A.pAddrTab[i] == infid)
                break;
        }
        if (i + obn > s_f2A.paranum)
        {
            ret = ReadDatItemNotSupport;
            break;
        }
        
        pdest = s_mdbs_snd.psndbuf;
        memset( pdest, 0, s_mdbs_snd.bufsize );
        *pdest ++ = i;          //offset value
        *pdest ++ = (u8)obn;    //object 
        
        while (obn --)
        {
            len = *psrc ++;
            memcpy( pdest, psrc, len );
            psrc += len;
            pdest += FUNC2ALEN;
        }
        pdest = s_mdbs_snd.psndbuf + 1;
        memcpy( ppara, s_mdbs_snd.psndbuf, (*pdest) * FUNC2ALEN + 2);
    }while (0);
    
    return ret;
}